function showUserWeekDay() {
   // 曜日の配列を作る
   var WeekChars = [ "日曜日", "月曜日", "火曜日", "水曜日", "木曜日", "金曜日", "土曜日" ];
 
   // ユーザの入力を得る
   var inputYear = document.getElementById("userYear").value;
   var inputMonth = document.getElementById("userMonth").value;
   var inputDate = document.getElementById("userDate").value;
 
   // 入力された数値から日付オブジェクトを作る
   var userDate = new Date( inputYear, inputMonth-1, inputDate );
 
   // 日付と曜日を表示する
   alert("指定された「" + 
      userDate.getFullYear() + "年" + 
      (userDate.getMonth()+1) + "月" + 
      userDate.getDate() + "日」は、" + 
      WeekChars[userDate.getDay()] + "です。");
}


/**
 * This script adds a "Made with Replit" badge to your repl when seen in full-browser view
 */

function main() {
  // Suppress in ReplView
  if (window.location.hostname.split('.')[1] === 'id') return;

  // Theme is passed from the script tag, default blue
  const themes = {
    dark: { fg: '#F5F9FC', bg: '#130F26' },
    light: { fg: '#130F26', bg: '#F5F9FC' },
    red: { fg: '#F5F9FC', bg: '#FA4B4B' },
    orange: { fg: '#F5F9FC', bg: '#D96D00' },
    yellow: { fg: '#F5F9FC', bg: '#A68A00' },
    lime: { fg: '#F5F9FC', bg: '#639400' },
    green: { fg: '#F5F9FC', bg: '#00A11B' },
    teal: { fg: '#F5F9FC', bg: '#0093B0' },
    blue: { fg: '#F5F9FC', bg: '#0F87FF' },
    blurple: { fg: '#F5F9FC', bg: '#8E78FF' },
    purple: { fg: '#F5F9FC', bg: '#B266FF' },
    magenta: { fg: '#F5F9FC', bg: '#EB3BEB' },
    pink: { fg: '#F5F9FC', bg: '#F545BA' },
  };
  const color = themes[document.currentScript.getAttribute('theme') || 'blue'];

  const badge = `
  <style>
  #replit-badge {
    position: fixed;
    cursor: pointer;
    bottom: 16px;
    right: 16px;
    z-index: 1000;
  }

  #replit-badge svg {
    opacity: 0.5;
    transition-property: opacity, transform;
    transition: opacity 120ms, transform 120ms;
    transition-timing-function: ease-out;
  }

  #replit-badge:hover svg {
    transform: scale(1.05);
    opacity: 1;
  }
  </style>
  
  <a id="replit-badge" href="/__repl?utm_medium=webview_badge" target="_blank">

  <svg width="153" height="36" viewBox="0 0 153 36" fill="none" xmlns="http://www.w3.org/2000/svg">
<g filter="url(#filter0_d_2_22)">
<rect x="3" width="147" height="30" rx="8" fill="${color.bg}"/>
</g>
<path d="M13 9.75C13 9.33579 13.3358 9 13.75 9H17.25C17.6642 9 18 9.33579 18 9.75V13H13.75C13.3358 13 13 12.6642 13 12.25V9.75Z" fill="${color.fg}"/>
<path d="M18 13H22.25C22.6642 13 23 13.3358 23 13.75V16.25C23 16.6642 22.6642 17 22.25 17H18V13Z" fill="${color.fg}"/>
<path d="M13 17.75C13 17.3358 13.3358 17 13.75 17H18V20.25C18 20.6642 17.6642 21 17.25 21H13.75C13.3358 21 13 20.6642 13 20.25V17.75Z" fill="${color.fg}"/>
<path d="M30 19.416H31.512V11.94H31.582L32.352 13.522L34.494 17.428L36.636 13.522L37.406 11.94H37.476V19.416H38.988V9.644H37.196L34.578 14.614H34.494L31.876 9.644H30V19.416Z" fill="${color.fg}"/>
<path d="M47.4783 19.416V18.17H46.7083V14.516C46.7083 12.892 45.6583 11.968 43.7823 11.968C42.3683 11.968 41.5143 12.57 41.0383 13.382L41.9483 14.208C42.3123 13.634 42.8303 13.214 43.6843 13.214C44.7063 13.214 45.1823 13.732 45.1823 14.614V15.23H43.8663C41.8363 15.23 40.7583 15.972 40.7583 17.414C40.7583 18.73 41.6123 19.584 43.1103 19.584C44.1743 19.584 44.9583 19.108 45.2383 18.198H45.3083C45.4063 18.912 45.8263 19.416 46.6243 19.416H47.4783ZM43.5443 18.422C42.7883 18.422 42.3123 18.086 42.3123 17.442V17.19C42.3123 16.56 42.8303 16.21 43.8943 16.21H45.1823V17.26C45.1823 17.974 44.4823 18.422 43.5443 18.422Z" fill="${color.fg}"/>
<path d="M53.5519 19.416H55.0779V9.056H53.5519V13.34H53.4819C53.1739 12.472 52.4039 11.968 51.4379 11.968C49.6039 11.968 48.5399 13.382 48.5399 15.776C48.5399 18.17 49.6039 19.584 51.4379 19.584C52.4039 19.584 53.1739 19.066 53.4819 18.212H53.5519V19.416ZM51.8999 18.268C50.8499 18.268 50.1499 17.526 50.1499 16.406V15.146C50.1499 14.026 50.8499 13.284 51.8999 13.284C52.8239 13.284 53.5519 13.788 53.5519 14.53V17.022C53.5519 17.764 52.8239 18.268 51.8999 18.268Z" fill="${color.fg}"/>
<path d="M60.1151 19.584C61.4731 19.584 62.5371 18.996 63.0831 18.114L62.1871 17.232C61.7671 17.904 61.1651 18.324 60.2691 18.324C59.0371 18.324 58.3511 17.526 58.3511 16.406V16.168H63.3491V15.594C63.3491 13.578 62.2571 11.968 60.1151 11.968C58.0431 11.968 56.7691 13.452 56.7691 15.776C56.7691 18.1 58.0431 19.584 60.1151 19.584ZM60.1151 13.158C61.1231 13.158 61.7391 13.9 61.7391 15.02V15.16H58.3511V15.062C58.3511 13.942 59.0651 13.158 60.1151 13.158Z" fill="${color.fg}"/>
<path d="M69.607 19.416H71.287L72.253 16.098L72.827 14.054H72.855L73.443 16.098L74.395 19.416H76.117L78.077 12.136H76.663L75.907 15.188L75.263 17.946H75.221L74.451 15.188L73.555 12.136H72.183L71.301 15.188L70.545 17.946H70.503L69.845 15.188L69.103 12.136H67.619L69.607 19.416Z" fill="${color.fg}"/>
<path d="M80.3006 10.834C80.9306 10.834 81.1966 10.498 81.1966 10.036V9.798C81.1966 9.336 80.9306 9 80.3006 9C79.6706 9 79.3906 9.336 79.3906 9.798V10.036C79.3906 10.498 79.6706 10.834 80.3006 10.834ZM79.5306 19.416H81.0566V12.136H79.5306V19.416Z" fill="${color.fg}"/>
<path d="M86.5817 19.416V18.17H85.1677V13.382H86.6937V12.136H85.1677V10.148H83.7957V11.422C83.7957 11.926 83.6277 12.136 83.1237 12.136H82.5077V13.382H83.6417V17.834C83.6417 18.828 84.2017 19.416 85.2517 19.416H86.5817Z" fill="${color.fg}"/>
<path d="M88.3489 19.416H89.8749V14.53C89.8749 13.69 90.6589 13.284 91.4569 13.284C92.3949 13.284 92.8289 13.858 92.8289 14.978V19.416H94.3549V14.796C94.3549 13.004 93.4729 11.968 91.9889 11.968C90.8689 11.968 90.2529 12.556 89.9449 13.34H89.8749V9.056H88.3489V19.416Z" fill="${color.fg}"/>
<path d="M101.473 15.468H103.419L105.379 19.416H107.143L105.029 15.3C106.275 14.936 106.933 13.97 106.933 12.584C106.933 10.778 105.855 9.644 104.105 9.644H99.8906V19.416H101.473V15.468ZM101.473 14.138V11.03H103.993C104.791 11.03 105.267 11.464 105.267 12.248V12.92C105.267 13.704 104.791 14.138 103.993 14.138H101.473Z" fill="${color.fg}"/>
<path d="M111.603 19.584C112.961 19.584 114.025 18.996 114.571 18.114L113.675 17.232C113.255 17.904 112.653 18.324 111.757 18.324C110.525 18.324 109.839 17.526 109.839 16.406V16.168H114.837V15.594C114.837 13.578 113.745 11.968 111.603 11.968C109.531 11.968 108.257 13.452 108.257 15.776C108.257 18.1 109.531 19.584 111.603 19.584ZM111.603 13.158C112.611 13.158 113.227 13.9 113.227 15.02V15.16H109.839V15.062C109.839 13.942 110.553 13.158 111.603 13.158Z" fill="${color.fg}"/>
<path d="M116.527 22.216H118.053V18.212H118.123C118.431 19.066 119.201 19.584 120.167 19.584C122.001 19.584 123.065 18.17 123.065 15.776C123.065 13.382 122.001 11.968 120.167 11.968C119.201 11.968 118.431 12.472 118.123 13.34H118.053V12.136H116.527V22.216ZM119.705 18.268C118.781 18.268 118.053 17.764 118.053 17.022V14.53C118.053 13.788 118.781 13.284 119.705 13.284C120.755 13.284 121.455 14.026 121.455 15.146V16.406C121.455 17.526 120.755 18.268 119.705 18.268Z" fill="${color.fg}"/>
<path d="M127.346 19.416V18.17H126.338V9.056H124.812V17.904C124.812 18.842 125.33 19.416 126.366 19.416H127.346Z" fill="${color.fg}"/>
<path d="M129.574 10.834C130.204 10.834 130.47 10.498 130.47 10.036V9.798C130.47 9.336 130.204 9 129.574 9C128.944 9 128.664 9.336 128.664 9.798V10.036C128.664 10.498 128.944 10.834 129.574 10.834ZM128.804 19.416H130.33V12.136H128.804V19.416Z" fill="${color.fg}"/>
<path d="M135.855 19.416V18.17H134.441V13.382H135.967V12.136H134.441V10.148H133.069V11.422C133.069 11.926 132.901 12.136 132.397 12.136H131.781V13.382H132.915V17.834C132.915 18.828 133.475 19.416 134.525 19.416H135.855Z" fill="${color.fg}"/>
<defs>
<filter id="filter0_d_2_22" x="0" y="0" width="153" height="36" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
<feFlood flood-opacity="0" result="BackgroundImageFix"/>
<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
<feOffset dy="3"/>
<feGaussianBlur stdDeviation="1.5"/>
<feComposite in2="hardAlpha" operator="out"/>
<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
<feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_2_22"/>
<feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_2_22" result="shape"/>
</filter>
</defs>
</svg>


  </a>
  `;

  document.body.insertAdjacentHTML('beforeend', badge);
}

main();